package com.example.franklinzquantum.myapplication;

import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.widget.ArrayAdapter;
import android.widget.ListView;


public class class12 extends AppCompatActivity {



    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.class12);
        ListView listView = (ListView) findViewById(R.id.listview12);//在视图中找到ListView
        ArrayAdapter<String> adapter = new ArrayAdapter<String>(this,android.R.layout.simple_list_item_1,data);//新建并配置ArrayAapeter
        listView.setAdapter(adapter);







    }

    String data[] = {"пойти, -иду, -идёшь -идут; пошёл, -шла, -шли【完】去，开始走，走起来 ","пригласить, -ашу, -асйшь, -асят [完]//【未】приглашйть,邀请；聘请 ","Обязательно【副】一定","выставка	展览；展览会","спектакль [阳]	演出","сосёд，复-и，-ей【阳】","сосёдка [阴]	邻居","Коллега【阳及阴】	同事，同行","аспирант 【阳】","Аспирантка【阴】研究生","статья	文章","читальный	阅读用的","зал	大厅","книжный	书的","снимать, -аю, -аешь, -ают [未] // 【完】снять, сниму, снимешь, снимут,снял, сняла, сняли (кого-что)拿下；脱下；免 去；租下来","квартйра	一套房间，（独户 的）住房","русско-китайский	俄汉的","Фрукт【常用复数】	水果","кейр	酸奶","получать, -аю，-аешь, -ают 【未】// 【完】получйть, -учy夕，-учuшь，-yчат收到；得到 ","пятёрка 【阴】	数字5;(学校成绩）五分","Четвёрка【阴】	数字4;(学校成绩）四分","брать, беру，берёшь, берут，брал，брала，брали ， взять, возьму возьмёшь, возьмут ，взял, взяла, взяли (когд-что)","拿；带着；买","курица, 【复】куры	鸡.母鸡","рыба	鱼","Послезавтра【副】	后天","проверить, -рю, -ришь, -рят【完】//【未】проверять，-яю，-яешь яют (кого-что)	检査；测验","выполнить, -ню, -нишь -нят【完】 // 【未】выполнять，-яю，-яешь -яют (что)	完成，执行","повторять, -яю -яешь, -яют 【未】 //【完】 повторйть, -pю，-ришь -рят，(что)	重复：复习","доклад	报告"," попробовать，-ую，уешь，-уют I 完I // 丨未丨 пробовать，-бую, -буемь， -буют	(когд-что)实验；（что)品尝; (接不定式）试图， 尝试","решить, -шу-шйшь -шат 【完】//【未】 решать, -аю, -аешь, -ают(接不定式）决定； (что)解答，解决 旁边，并列着；在一起","Всегда【副】通常"," Серьёзно【副】严肃的，认真的 ","Можно【用作谓语】（接不定式）可以","старшекурсник 【阳】","старшекурсница 【阴】(大学的）高年级 学生","современный	现代的","Хотй【连】	虽然","объяснять, -яю, -яешь -яют【未】 //【完】объяснйть, -ню -нишь -нят (что)	讲解，说明","Трудно【副】困难地；【用作谓语】吃力，很难","Конечно【插入语】当然","мочь, могу  можешь, могут мог, могла, могли【未】//【完】смочь (接不定式）	能，能够.可能","мочь, могу  можешь, могут мог, могла, могли【未】//【完】смочь (接不定式）	能，能够.可能"};
























}


