package com.example.franklinzquantum.myapplication;

import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.widget.ArrayAdapter;
import android.widget.ListView;


public class class15 extends AppCompatActivity {



    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.class15);
        ListView listView = (ListView) findViewById(R.id.listview15);//在视图中找到ListView
        ArrayAdapter<String> adapter = new ArrayAdapter<String>(this,android.R.layout.simple_list_item_1,data);//新建并配置ArrayAapeter
        listView.setAdapter(adapter);







    }

    String data[] ={"передать, -ам -ашь, -аст -адим, -адйте, -адут；передал, передала, передали 【完】 /【未】 передавать, -даю -даёшь, -дают (когд-что)交给，转交","Кудa[副]	到哪儿?去哪里","деканат	系主任办公室","компьютерный	电脑的","лаборатория	实验室","компьютерная лаборатория 计算机房","первокурсник 【阳】","Первокyрсница【阴】一年级大学生","пройть, пройду, пройдешь, пройдут; прошёл，-шла，-шли 【完】//【未】 проходить, -ожу -одишь, -одят 走过去，走到；学完(кому-нему)向.朝；快到	的时候","малый	小的，小号的","галерея	走廊，回廊","пушкинский	普希金的","no(кому-чему)	沿着……，在…… 在……方面","без 	没有，不带","мобильник	手机","университетский	大学的","легко 	轻快地；容易","лёгкий 轻的；容易的","интересно 1副 1	有趣地；【用作谓语副词】很有意思	","Весело【副】	愉快地；【用作谓语副词】高兴，快活","разговор	谈话","будьте добрь!	劳驾","подарок, -рка	礼物","рождение	出生","универмаг	百货商店","Подарйть【完】 //【未】 дарйть, дарю,	даришь, дарят (кому -чему	","когo-что)赠送","сначала 开始.最初","продавец 【阳】 продавщица【阴】售货员","показать, -ажу -ажешь -ажут【完】//【未】 показываь,-aю, -оешь,-aют 把...	给...	看","нравиться, -влюсь, -вишься -вятся【未】 // 【完】 понравиться 	引起（某人)爱慕；使（某人感到）喜欢","стоить, стою  стоишь стоят 值(多少)，价钱 ","приехать, -ёду -едешь, -едут 【完】/【未】приезжать，-аю,-аешь ают(乘马、船）来到 ","дблго【副】	长久地","наконец最后，终于","шарф	围巾，头巾","поехать, -еду, -едешь, -едут(乘车、船等)前往，出发","ленинский 列宁的","этаж, -а	  楼层","домой回家","помочь, -огу -ожешь, огут，-ог， -огла, -огли 【未】//【完】помогать.-аю -аешь.-ают (кому-чему) 帮助，援助：【一、 二人你不用】发生，作用，见效","приготовить,-влю -вишь, -вят 【完】 //【未】 приготавливать, -аю, -аешь, -ают (кого-что)把……准备好","прийтй, приду, придёшь，придут; пришёл， -шла，-шли 【完】 //【未】приходить, -ожу， -одишь， -одят 到来，来到"};
























}


