package com.example.franklinzquantum.myapplication;

import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.widget.ArrayAdapter;
import android.widget.ListView;



public class class7 extends AppCompatActivity {



    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.class7);
        ListView listView = (ListView) findViewById(R.id.listview7);//在视图中找到ListView
        ArrayAdapter<String> adapter = new ArrayAdapter<String>(this,android.R.layout.simple_list_item_1,data);//新建并配置ArrayAapeter
        listView.setAdapter(adapter);







    }

      String data[] ={"Осень 秋天","осенью （在）秋天","завтра 明天","спасибо 谢谢","цветы 花","Привет 你好！","такси 出租车","здесь 这里","Семья 复семьи 家庭；一家人","сестра 姐妹","сейчас 现在，马上","себя 自己","сегодня 今天","Месяц 月","зима 冬天","зимой （在）冬天","озеро 湖","газета 报纸","журнал 杂志；记事簿","музей 博物馆","магазин 商店","Фильм 影片","Телефон 电话","лето 夏天","летом （在）夏天","хлеб 面包","Рубль 卢布","Июль 七月","письмо 复письма 信；书写；写作","библиотека 图书馆","поле 田野","стадион 体育馆","мальчик 男孩","сколько 多少","Только 仅；只只","туфли 布鞋","улица 道路","писатель 作家","учитель 【阳】","Учительница 【阴】（中小学）教师；教员","восемь 八","десять 十","любить люблю любишь любят 爱","Понедельник 星期一","воскресенье 星期日","по-китайски 用汉语","по-английски 用英语","По-русски 用俄语","русский 俄罗斯的；俄语的","Брюки 裤子","Кино 影院","Пожалуйста 【语气】请","деньги 钱","стихи 诗","химия 化学","химик 化学家","красивый 美丽的；漂亮的","здорово 真好；真棒","До свидания! 再见","Хороший 好的","вкусно 好吃；可口","Студент 【阳】","Студентка 【阴】大学生","Институт русского языка 俄语学院","вопрос 问题","Преподаватель 【阳】","Преподавательница 【阴】（中、高等学校）教师，教员","Учёба 学习","Идти иду идёшь идут 走；步行","Ехать еду едешь едут （乘车）去；来","Разговаривать разговариваю разговариваешь разговаривают 交谈","Мечтать мечтаю мечтаешь мечтают 幻想；向往","Отвечать отвечаю отвечаешь отвечают 回答","Изучать изучаю изучаешь изучают 学习；研究","Заниматься Занимаюсь Занимаешься Занимаються 从事；学习"};

























}


